## Importing libraries

In [1]:
import pandas as pd

### reading the data

In [2]:
data = pd.read_csv("data.csv")

In [3]:
data.head()

,order_id,shop_id,user_id,order_amount,total_items,payment_method,created_at
0,1,53,746,224,2,cash,2017-03-13 12:36:56
1,2,92,925,90,1,cash,2017-03-03 17:38:52
2,3,44,861,144,1,cash,2017-03-14 4:23:56
3,4,18,935,156,1,credit_card,2017-03-26 12:43:37
4,5,18,883,156,1,credit_card,2017-03-01 4:35:11

## Things going through my head:

- Exactly 100 Shops.
- Sells only one model of shoe. 
- 30 day window. 
- Naive Calculation: $3145.13 
- Selling Sneakers, relatively affordable item. 

Calculate the AOV(Average Order Value): which is the average value of a single order.

Let's start with the total order amount.

In [4]:
data['order_amount'].sum()

15725640

15725640 is the Total Amount generated; considering for e.g the first entry, of 224 
is actually 112x2 or 2 items of 112 sold at 224

In [5]:
# Let's confirm that the shop number 73 sells the sneaker model 112. 
data[data['shop_id'] == 53]
# As we can see in the below table, the order_amount is the total amount. It sells items of $112.

,order_id,shop_id,user_id,order_amount,total_items,payment_method,created_at
0,1,53,746,224,2,cash,2017-03-13 12:36:56
27,28,53,942,112,1,credit_card,2017-03-17 9:41:53
56,57,53,739,560,5,credit_card,2017-03-18 8:45:21
85,86,53,908,224,2,credit_card,2017-03-27 20:46:35
103,104,53,740,224,2,cash,2017-03-17 7:29:30
...,...,...,...,...,...,...,...
4691,4692,53,857,224,2,debit,2017-03-22 6:29:38
4744,4745,53,716,224,2,cash,2017-03-10 8:33:39
4862,4863,53,917,112,1,debit,2017-03-10 10:07:03
4920,4921,53,907,336,3,cash,2017-03-16 9:52:17
4947,4948,53,805,336,3,debit,2017-03-28 2:23:45

In [6]:
values = []
for i in range(100): #Since we know there are 100 shops
    x = data[data['shop_id']==i]['order_amount'].sum()
#     if x == 11990176: #I hard coded this value from the below cell, just to find which shop had the most sales
#         print("Max value by:", i)
    values.append(x)

In [7]:
max(values) #max sold by a shop in 1 month
# Used this value in the above cell to quickly figure out the best performing store.

11990176

Shop 42 had the maximum sales.

In [8]:
#Now, Let's try to figure out the average sales in a month. 
total_sales = data['order_amount'].sum() #Adding up the total order amounts
print(total_sales)

15725640

15725640 is the Total Sales in the month.
What we need: Average Order Value. 

To find the AOV, We have the total amount generated by 100 shops. Now, we need to find the total number of orders. Then, We can divide them both to come up with the approximate AOV.

In [9]:
total_items = data['total_items'].sum() # Total Items  
print(total_items)

43936

43936 is the average number of items sold by a shop per day.

In [10]:
AOV = total_sales/total_items
print(AOV)

357.92152221412965

This Analysis has shown that the average order value is $357.92; 

For this, I calculated the total Sales. 

Then I calculated the total quantity of items sold.

I divided the two.

# Question number 2:
a. How many orders were shipped by Speedy Express in total?
I'm assuming the Database provided on w3schools belongs to Speedy Express.

Query:
- SELECT COUNT(OrderID) FROM Orders;

### Output: 196

b. What is the last name of the employee with the most orders?
Query: 

Query:

SELECT LastName

FROM (SELECT e.LastName, COUNT(o.OrderID) as num_sales

	FROM Employees e
    
    JOIN Orders o ON o.EmployeeID=e.EmployeeID
    
    GROUP BY o.EmployeeID
    
    ORDER BY num_sales DESC)
    
LIMIT 1;

### Output: Peacock

c. What product was ordered the most by customers in Germany?
Query:

Query: 

SELECT p.ProductName

FROM Products p,

	OrderDetails od, 
    
    Orders o,
    
    Customers c
    
WHERE p.productID = od.ProductID 

AND od.orderid = o.orderid

AND o.customerid = c.customerid

AND c.Country = "Germany"

GROUP BY ProductName

ORDER BY SUM(od.Quantity) DESC

LIMIT 1;

### Output: Boston Crab Meat